while True:
    user_says = input('Напиши слово: ')
    if user_says == ' ':
        print('Ты не ввел слово...')
    if user_says == 'абажур':
        print('Это слово написано верно!')
    if user_says == 'обажур':
        print('Ой, ошибка... Наверное, ты хотел написать: АБАЖУР')
    if user_says == 'обожур':
        print('Ой, ошибка... Наверное, ты хотел написать: АБАЖУР')
    if user_says == 'аббревиатура':
        print('Это слово написано верно!')
    if user_says == 'абревиатура':
        print('Ой, ошибка... Наверное, ты хотел написать: АББРЕВИАТУРА')
    if user_says == 'обревиатура':
        print('Ой, ошибка... Наверное, ты хотел написать: АББРЕВИАТУРА')
    if user_says == 'абзац':
        print('Это слово написано верно!')
    if user_says == 'обзац':
        print('Ой, ошибка... Наверное, ты хотел написать: АБЗАЦ')
    if user_says == 'обзатс':
        print('Ой, ошибка... Наверное, ты хотел написать: АБЗАЦ')
    if user_says == 'абитуриент':
        print('Это слово написано верно!')
    if user_says == 'обитуриент':
        print('Ой, ошибка... Наверное, ты хотел написать: АБИТУРИЕНТ')
    if user_says == 'обетуриент':
        print('Ой, ошибка... Наверное, ты хотел написать: АБИТУРИЕНТ')
    if user_says == 'абетуриент':
        print('Ой, ошибка... Наверное, ты хотел написать: АБИТУРИЕНТ')
    if user_says == 'абонемент':
        print('Это слово написано верно!')
    if user_says == 'обонемент':
        print('Ой, ошибка... Наверное, ты хотел написать: АБОНЕМЕНТ')
    if user_says == 'абонимент':
        print('Ой, ошибка... Наверное, ты хотел написать: АБОНЕМЕНТ')
    if user_says == 'обонимент':
        print('Ой, ошибка... Наверное, ты хотел написать: АБОНЕМЕНТ')
    if user_says == 'абонент':
        print('Это слово написано верно!')
    if user_says == 'обонент':
        print('Ой, ошибка... Наверное, ты хотел написать: АБОНЕНТ')
    if user_says == 'абориген':
        print('Это слово написано верно!')
    if user_says == 'обориген':
        print('Ой, ошибка... Наверное, ты хотел написать: АБОРИГЕН')
    if user_says == 'обореген':
        print('Ой, ошибка... Наверное, ты хотел написать: АБОРИГЕН')
    if user_says == 'обареген':
        print('Ой, ошибка... Наверное, ты хотел написать: АБОРИГЕН')
    if user_says == 'абореген':
        print('Ой, ошибка... Наверное, ты хотел написать: АБОРИГЕН')
    if user_says == 'абрикос':
        print('Это слово написано верно!')
    if user_says == 'абрекос':
        print('Ой, ошибка... Наверное, ты хотел написать: АБРИКОС')
    if user_says == 'обрекос':
        print('Ой, ошибка... Наверное, ты хотел написать: АБРИКОС')
    if user_says == 'обрикос':
        print('Ой, ошибка... Наверное, ты хотел написать: АБРИКОС')
    if user_says == 'абстрактный':
        print('Это слово написано верно!')
    if user_says == 'обстрактный':
        print('Ой, ошибка... Наверное, ты хотел написать: АБСТРАКТНЫЙ')
    if user_says == 'абстракция':
        print('Это слово написано верно!')
    if user_says == 'обстракция':
        print('Ой, ошибка... Наверное, ты хотел написать: АБСТРАКЦИЯ')
    if user_says == 'авангард':
        print('Это слово написано верно!')
    if user_says == 'овангард':
        print('Ой, ошибка... Наверное, ты хотел написать: АВАНГАРД')
    if user_says == 'овонгард':
        print('Ой, ошибка... Наверное, ты хотел написать: АВАНГАРД ')
    if user_says == 'авонгард':
        print('Ой, ошибка... Наверное, ты хотел написать: АВАНГАРД ')
    if user_says == 'аппаратура':
        print('Это слово написано верно!')
    if user_says == 'апаратура':
        print('Ой, ошибка... Наверное, ты хотел написать: АППАРАТУРА')
    if user_says == 'асессор':
        print('Это слово написано верно!')
    if user_says == 'асесор':
        print('Ой, ошибка... Наверное, ты хотел написать: АСЕССОР')
    if user_says == 'аттестат':
        print('Это слово написано верно!')
    if user_says == 'атестат':
        print('Ой, ошибка... Наверное, ты хотел написать: АТТЕСТАТ ')
    if user_says == 'аттракцион':
        print('Это слово написано верно!')
    if user_says == 'атракцион':
        print('Ой, ошибка... Наверное, ты хотел написать: АТТРАКЦИОН ')
    if user_says == 'аккорд':
        print('Это слово написано верно!')
    if user_says == 'акорд':
        print('Ой, ошибка... Наверное, ты хотел написать: АККОРД ')
    if user_says == 'аккомпаниатор':
        print('Это слово написано верно!')
    if user_says == 'акомпаниатор':
        print('Ой, ошибка... Наверное, ты хотел написать: АККОМПАНИАТОР ')
    if user_says == 'балласт':
        print('Это слово написано верно!')
    if user_says == 'баласт':
        print('Ой, ошибка... Наверное, ты хотел написать: БАЛЛАСТ ')
    if user_says == 'барокко':
        print('Это слово написано верно!')
    if user_says == 'бароко':
        print('Ой, ошибка... Наверное, ты хотел написать: БАРОККО ')
    if user_says == 'баррикада':
        print('Это слово написано верно!')
    if user_says == 'барикада':
        print('Ой, ошибка... Наверное, ты хотел написать: БАРРИКАДА ')
    if user_says == 'барельеф':
        print('Это слово написано верно!')
    if user_says == 'борельеф':
        print('Ой, ошибка... Наверное, ты хотел написать: БАРЕЛЬЕФ ')
    if user_says == 'батискаф':
        print('Это слово написано верно!')
    if user_says == 'ботискаф':
        print('Ой, ошибка... Наверное, ты хотел написать: БАТИСКАФ ')
    if user_says == 'батескаф':
        print('Ой, ошибка... Наверное, ты хотел написать: БАТИСКАФ  ')
    if user_says == 'белиберда':
        print('Это слово написано верно!')
    if user_says == 'белеберда':
        print('Ой, ошибка... Наверное, ты хотел написать: БЕЛИБЕРДА ')
    if user_says == 'бельэтаж':
        print('Это слово написано верно!')
    if user_says == 'бельетаж':
        print('Ой, ошибка... Наверное, ты хотел написать: БЕЛЬЭТАЖ ')
    if user_says == 'бесчувственный':
        print('Это слово написано верно!')
    if user_says == 'бесчуственный':
        print('Ой, ошибка... Наверное, ты хотел написать: БЕСЧУВСТВЕННЫЙ ')
    if user_says == 'бесчуственый':
        print('Ой, ошибка... Наверное, ты хотел написать: БЕСЧУВСТВЕННЫЙ ')
    if user_says == 'бесчуствиный':
        print('Ой, ошибка... Наверное, ты хотел написать: БЕСЧУВСТВЕННЫЙ ')
    if user_says == 'безчувственный':
        print('Ой, ошибка... Наверное, ты хотел написать: БЕСЧУВСТВЕННЫЙ ')
    if user_says == 'веранда':
        print('Это слово написано верно!')
    if user_says == 'виранда':
        print('Ой, ошибка... Наверное, ты хотел написать: ВЕРАНДА')
    if user_says == 'вереница':
        print('Это слово написано верно!')
    if user_says == 'вериница':
        print('Ой, ошибка... Наверное, ты хотел написать: ВЕРЕНИЦА ')
    if user_says == 'гипотеза':
        print('Это слово написано верно!')
    if user_says == 'гепотиза':
        print('Ой, ошибка... Наверное, ты хотел написать: ГИПОТЕЗА ')
    if user_says == 'гепотеза':
        print('Ой, ошибка... Наверное, ты хотел написать: ГИПОТЕЗА ')
    if user_says == 'гипотиза':
        print('Ой, ошибка... Наверное, ты хотел написать: ГИПОТЕЗА ')
    if user_says == 'гостиная':
        print('Это слово написано верно!')
    if user_says == 'гостинная':
        print('Ой, ошибка... Наверное, ты хотел написать: ГОСТИНАЯ ')
    if user_says == 'дебют':
        print('Это слово написано верно!')
    if user_says == 'дибют':
        print('Ой, ошибка... Наверное, ты хотел написать: ДЕБЮТ ')
    if user_says == 'дорога':
        print('Это слово написано верно!')
    if user_says == 'дарога':
        print('Ой, ошибка... Наверное, ты хотел написать: ДОРОГА ')
    if user_says == 'древнерусский':
        print('Это слово написано верно!')
    if user_says == 'древнеруский':
        print('Ой, ошибка... Наверное, ты хотел написать: ДРЕВНЕРУССКИЙ ')
    if user_says == 'ежевика':
        print('Это слово написано верно!')
    if user_says == 'еживика':
        print('Ой, ошибка... Наверное, ты хотел написать: ЕЖЕВИКА ')
    if user_says == 'жюри':
        print('Это слово написано верно!')
    if user_says == 'жури':
        print('Ой, ошибка... Наверное, ты хотел написать: ЖЮРИ ')
    if user_says == 'званый':
        print('Это слово написано верно!')
    if user_says == 'званный':
        print('Ой, ошибка... Наверное, ты хотел написать: ЗВАНЫЙ ')
    if user_says == 'идиома':
        print('Это слово написано верно!')
    if user_says == 'идеома':
        print('Ой, ошибка... Наверное, ты хотел написать: ИДИОМА ')
    if user_says == 'иллюстрация':
        print('Это слово написано верно!')
    if user_says == 'илюстрация':
        print('Ой, ошибка... Наверное, ты хотел написать: ИЛЛЮСТРАЦИЯ ')
    if user_says == 'иммунитет':
        print('Это слово написано верно!')
    if user_says == 'имунитет':
        print('Ой, ошибка... Наверное, ты хотел написать: ИММУНИТЕТ ')
    if user_says == 'счастье':
        print('Это слово написано верно!')
    if user_says == 'щастье':
        print('Ой, ошибка... Наверное, ты хотел написать: СЧАСТЬЕ ')
    elif user_says == 'stop':
        print('Возвращайся скорее!')
        break


